; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	spectrograph5 - mode
	image0 - mode
	thermograph4 - mode
	spectrograph6 - mode
	infrared2 - mode
	image1 - mode
	image3 - mode
	GroundStation2 - direction
	Star3 - direction
	GroundStation0 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 spectrograph6)
	(calibration_target instrument0 Star3)
	(supports instrument1 image3)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument2 image1)
	(supports instrument2 infrared2)
	(calibration_target instrument2 Star3)
	(supports instrument3 spectrograph5)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star11)
	(supports instrument4 spectrograph5)
	(supports instrument4 thermograph4)
	(calibration_target instrument4 GroundStation4)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation4)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star11)
	(supports instrument6 image3)
	(calibration_target instrument6 GroundStation0)
	(supports instrument7 image3)
	(supports instrument7 spectrograph5)
	(supports instrument7 image0)
	(calibration_target instrument7 GroundStation4)
	(supports instrument8 spectrograph6)
	(supports instrument8 image3)
	(calibration_target instrument8 GroundStation1)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet9)
	(supports instrument9 spectrograph6)
	(supports instrument9 infrared2)
	(calibration_target instrument9 GroundStation1)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation2)
)
(:goal (and
	(have_image Phenomenon5 spectrograph5)
	(have_image Phenomenon5 thermograph4)
	(have_image Phenomenon6 image0)
	(have_image Planet7 thermograph4)
	(have_image Phenomenon8 spectrograph6)
	(have_image Planet9 image3)
	(have_image Phenomenon10 image3)
	(have_image Star11 spectrograph6)
))

)

; plan
1. (turn_to satellite3 groundstation4 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 groundstation4)
   goals met: 0 of 8
2. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 0 of 8
3. (calibrate satellite3 instrument7 groundstation4)
   added: (calibrated instrument7)
   goals met: 0 of 8
4. (turn_to satellite3 phenomenon6 groundstation4)
   deleted: (pointing satellite3 groundstation4)
   added: (pointing satellite3 phenomenon6)
   goals met: 0 of 8
5. (take_image satellite3 phenomenon6 instrument7 image0)
   added: (have_image phenomenon6 image0)
   goals met: 1 of 8
6. (turn_to satellite3 phenomenon10 phenomenon6)
   deleted: (pointing satellite3 phenomenon6)
   added: (pointing satellite3 phenomenon10)
   goals met: 1 of 8
7. (turn_to satellite2 groundstation4 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 groundstation4)
   goals met: 1 of 8
8. (turn_to satellite0 star3 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star3)
   goals met: 1 of 8
9. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 1 of 8
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 8
11. (calibrate satellite2 instrument4 groundstation4)
   added: (calibrated instrument4)
   goals met: 1 of 8
12. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 1 of 8
13. (take_image satellite3 phenomenon10 instrument7 image3)
   added: (have_image phenomenon10 image3)
   goals met: 2 of 8
14. (turn_to satellite0 phenomenon8 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon8)
   goals met: 2 of 8
15. (take_image satellite0 phenomenon8 instrument0 spectrograph6)
   added: (have_image phenomenon8 spectrograph6)
   goals met: 3 of 8
16. (turn_to satellite0 star11 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star11)
   goals met: 3 of 8
17. (take_image satellite0 star11 instrument0 spectrograph6)
   added: (have_image star11 spectrograph6)
   goals met: 4 of 8
18. (turn_to satellite2 phenomenon5 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 phenomenon5)
   goals met: 4 of 8
19. (take_image satellite2 phenomenon5 instrument4 spectrograph5)
   added: (have_image phenomenon5 spectrograph5)
   goals met: 5 of 8
20. (take_image satellite2 phenomenon5 instrument4 thermograph4)
   added: (have_image phenomenon5 thermograph4)
   goals met: 6 of 8
21. (turn_to satellite2 planet7 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 planet7)
   goals met: 6 of 8
22. (take_image satellite2 planet7 instrument4 thermograph4)
   added: (have_image planet7 thermograph4)
   goals met: 7 of 8
23. (turn_to satellite3 planet9 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 planet9)
   goals met: 7 of 8
24. (take_image satellite3 planet9 instrument7 image3)
   added: (have_image planet9 image3)
   goals met: 8 of 8
